Revit 2026 API

# RebarContainerGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<RebarContainerItem> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of RebarContainerItem)
```
```cpp
public:
virtual IEnumerator<RebarContainerItem^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<RebarContainerItem>
override GetEnumerator : unit -> IEnumerator<RebarContainerItem>
```

#### Return Value

IEnumeratorRebarContainerItemAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace